# YOLOv5 🚀 by Ultralytics, GPL-3.0 license
# 5008421 parameters, 5008421 gradients, 10.6 GFLOPs
# Parameters
nc: 80 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, stem, [32, "ReLU6"]], # 0-P1/2
    [-1, 1, MBConvBlock, [16, 3, 1, 1, 0]],
    [-1, 1, MBConvBlock, [24, 3, 2, 6, 0.028, True]], # 2-P2/4
    [-1, 1, MBConvBlock, [24, 3, 1, 6, 0.057]],
    [-1, 1, MBConvBlock, [40, 5, 2, 6, 0.085]], # 4-P3/8
    [-1, 1, MBConvBlock, [40, 5, 1, 6, 0.114]],
    [-1, 1, MBConvBlock, [80, 3, 2, 6, 0.142]], # 6-P4/16
    [-1, 1, MBConvBlock, [80, 3, 1, 6, 0.171]],
    [-1, 1, MBConvBlock, [80, 3, 1, 6, 0.200]],
    [-1, 1, MBConvBlock, [112, 5, 1, 6, 0.228]], # 9
    [-1, 1, MBConvBlock, [112, 5, 1, 6, 0.257]],
    [-1, 1, MBConvBlock, [112, 5, 1, 6, 0.285]],
    [-1, 1, MBConvBlock, [192, 5, 2, 6, 0.314]], # 12-P5/32
    [-1, 1, MBConvBlock, [192, 5, 1, 6, 0.342]],
    [-1, 1, MBConvBlock, [192, 5, 1, 6, 0.371]],
    [-1, 1, MBConvBlock, [192, 5, 1, 6, 0.400]],
    [-1, 1, MBConvBlock, [320, 3, 1, 6, 0.428]], # 16
  ]

# YOLOv5 v6.0 head
head: [
    [-1, 1, Conv, [160, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 11], 1, Concat, [1]], # cat backbone P4
    [-1, 3, C3, [160, False]], # 21

    [-1, 1, Conv, [80, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, "nearest"]],
    [[-1, 5], 1, Concat, [1]], # cat backbone P3
    [-1, 3, C3, [80, False]], # 25 (P3/8-small)

    [-1, 1, Conv, [80, 3, 2]],
    [[-1, 21], 1, Concat, [1]], # cat head P4
    [-1, 3, C3, [160, False]], # 28 (P4/16-medium)

    [-1, 1, Conv, [160, 3, 2]],
    [[-1, 17], 1, Concat, [1]], # cat head P5
    [-1, 3, C3, [320, False]], # 31 (P5/32-large)

    [[24, 27, 30], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
